Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ལ་ཡང་སྤྱོད་བཞིན་དུ།
en: Chapter 48 Then Śakra, mighty lord of the gods, thought, “If bodhisattva great beings outshine all beings while just practicing the perfection of generosity, the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, the perfection of wisdom, the emptiness of internal phenomena, [all the other aspects of emptiness] up to and including the emptiness of the essential nature of nonentities, the applications of mindfulness, the correct exertions, the supports for miraculous ability, the faculties, the powers, the branches of enlightenment, the noble eightfold path, the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the aspects of liberation, the serial steps of meditative absorption, emptiness, signlessness, wishlessness, the extrasensory powers, the meditative stabilities, the dhāraṇī gateways, the ten powers of the tathāgatas, the four fearlessnesses, the four kinds of exact knowledge, great loving kindness, great compassion, and the eighteen distinct qualities of the buddhas, what need one say when they have attained consummate buddhahood in unsurpassed, complete enlightenment!

source: སེམས་ཅན་ཐམས་ཅད་ཟིལ་གྱིས་ནོན་ན། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པར་གྱུར་ན་ལྟ་ཅི་སྨོས། སེམས་ཅན་གང་གི་སེམས། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་འཇུག་པ་དེ་དག་ཀྱང་ཐོབ་པ་ལེགས་པར་ཐོབ་ཅིང་། དེ་དག་གི་འཚོ་བ་ལེགས་པར་འཚོ་བ་ཡིན་ན།
en: If even those beings whose minds are just introduced to all-aspect omniscience excellently acquire the attainments, and if even those beings sustain themselves excellently through their livelihoods, what need one say about those who have set their minds on unsurpassed, complete enlightenment!

source: གང་གིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པ་དག་ལྟ་ཅི་སྨོས། སེམས་ཅན་གང་གིས་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་དེ། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་འདི་ཉན་པ་དེ་དག་ནི་ཀུན་གྱིས་ཡིད་དུ་འོང་བར་བྱ་བ་ཡིན་ནོ་སྙམ་ནས།
en: Those beings who have set their minds on unsurpassed, complete enlightenment and listen to this perfection of wisdom are to be emulated by all.”

source: དེ་ནས་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་གྱིས་མེ་ཏོག་མན་དཱ་ར་བ་མང་པོ་བླངས་ཏེ། བཅོམ་ལྡན་འདས་གང་ན་བ་དེར་སོང་ནས། མེ་ཏོག་མན་དཱ་ར་བ་དེ་དག་གིས། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ལ་གཏོར་ཏོ། །མངོན་པར་གཏོར་ཏོ། །རབ་ཏུ་གཏོར་ཏོ། །དེ་ལྟར་གཏོར་ཏེ། མངོན་པར་གཏོར་བ་དང་། རབ་ཏུ་གཏོར་བ་བྱས་ནས། ཚིག་འདི་སྐད་ཅེས་བརྗོད་དོ། །དགེ་བའི་རྩ་བ་འདིས་གང་ཟག་བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་པ་གང་གིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་དམིགས་པ་དེ་དག་གི་སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ཡོངས་སུ་རྫོགས་པར་གྱུར་ཅིག །
en: Then Śakra, mighty lord of the gods, took many coral tree flowers, and, going into the presence of the Blessed One, scattered those coral flowers, scattered them more vigorously, and scattered them with utmost vigor toward the tathāgata, arhat, completely awakened Buddha, saying, “By this root of virtue may those individuals who follow the vehicle of the bodhisattvas, with their focus intent on unsurpassed, complete enlightenment, perfect the attributes of the buddhas!

source: རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་རྣམས་ཀྱི་ཆོས་ཀུན་ཡོངས་སུ་རྫོགས་པར་གྱུར་ཅིག །
en: May they all perfect the attributes of all-aspect omniscience!

source: རང་བྱུང་གི་ཆོས་རྣམས་ཡོངས་སུ་རྫོགས་པར་གྱུར་ཅིག །ཟག་པ་མེད་པའི་ཆོས་རྣམས་ཡོངས་སུ་རྫོགས་པར་གྱུར་ཅིག །
en: May they perfect the attributes that naturally arise, and may they perfect the attributes that are free from contaminants! “

source: བཅོམ་ལྡན་འདས་བདག་ནི་གང་ཟག་བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་པ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡང་དག་པར་ཞུགས་པ། སླར་ལྡོག་པར་འགྱུར་བར་སེམས་འགའ་ཙམ་ཡང་སྐྱེ་བ་མ་མཆིས་སོ།
en: Blessed Lord, I do not in the slightest think that individuals who follow the vehicle of the bodhisattvas will regress, having set out for unsurpassed, complete enlightenment.

source: །བཅོམ་ལྡན་འདས་བདག་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སླར་ལྡོག་ཏེ། ཉན་ཐོས་སམ། རང་སངས་རྒྱས་སུ་འགྱུར་བར་སེམས་འགའ་ཙམ་ཡང་སྐྱེ་བར་འགྱུར་བ་མ་མཆིས་ཀྱི།
en: Blessed Lord, I do not in the slightest think that these bodhisattva great beings will regress and become śrāvakas or pratyekabuddhas.

source: བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མོས་པ་སྐྱེད་ཅིང་།
en: On the contrary, they will long for unsurpassed, complete enlightenment, {Ki.

source: ཡང་དང་ཡང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སྨོན་ལམ་འདེབས་པ་དང་།
en: V: 36} and they will aspire again and again toward unsurpassed, complete enlightenment.

source: འཁོར་བའི་སྡུག་བསྔལ་མང་པོ་འདི་དག་མཐོང་ནས། ལྷ་དང་། མི་དང་། ལྷ་མ་ཡིན་དུ་བཅས་པའི་འཇིག་རྟེན་གྱི་དོན་དུ་མོས། སྨན་པར་མོས།
en: Seeing the many sufferings of cyclic existence, they will resolve to benefit the whole world, with its gods, humans, and asuras; they will resolve to alleviate [its sufferings], to make them happy and secure.

source: བདེ་བར་མོས་ཤིང་། ལེགས་པར་བགྱི་བར་མོས་ཏེ། སེམས་བསྐྱེད་པ་དེ་ལྟ་བུ་དག་དང་ལྡན་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་འདི་ལྟར་རྟོག་སྟེ། ཅི་བདག་རྒལ་ནས་སེམས་ཅན་མ་རྒལ་བ་སྒྲོལ་བར་འགྱུར་རམ།
en: Bodhisattva great beings who have such a mindset will think, ‘Whatever happens, once I have crossed [beyond cyclic existence], I must save those beings who have not yet crossed beyond it!

source: ཅི་བདག་གྲོལ་ནས་སེམས་ཅན་མ་གྲོལ་བ་འགྲོལ་བར་འགྱུར་རམ།
en: Whatever happens, once I have been liberated, I must liberate those beings who have not yet been liberated!

source: ཅི་བདག་དབུགས་ཕྱིན་ནས་སེམས་ཅན་དབུགས་མ་བྱུང་བ་དབུགས་འབྱིན་པར་འགྱུར་རམ།
en: Whatever happens, once I have been inspired, I must inspire those beings who have not yet been inspired!

source: ཅི་བདག་ཡོངས་སུ་མྱ་ངན་ལས་འདས་ནས། སེམས་ཅན་ཡོངས་སུ་མྱ་ངན་ལས་མ་འདས་པ་ཡོངས་སུ་མྱ་ངན་ལས་ཟློ་བར་འགྱུར་རམ་ཞེས་རྟོག་སྟེ།
en: Whatever happens, once I have attained final nirvāṇa, I must bring to final nirvāṇa those beings who have not attained final nirvāṇa!’ “

source: བཅོམ་ལྡན་འདས་དེ་ལྟར་ཐེག་པ་ལ་གསར་དུ་ཞུགས་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་སེམས་བསྐྱེད་པ་དེ་དག་ལ་རྗེས་སུ་ཡི་རང་བར་བགྱིད་པ་དང་། ཡུན་རིང་པོ་ནས་སྤྱོད་སྤྱོད་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་སེམས་བསྐྱེད་པ་དེ་དག་ལ་རྗེས་སུ་ཡི་རང་བར་བགྱིད་པ་དང་། ཕྱིར་མི་ལྡོག་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་སེམས་བསྐྱེད་པ་དེ་དག་ལ་རྗེས་སུ་ཡི་རང་བར་བགྱིད་པ་དང་། སྐྱེ་བ་གཅིག་གིས་ཐོགས་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་སེམས་བསྐྱེད་པ་དེ་དག་ལ་རྗེས་སུ་ཡི་རང་བར་བགྱིད་ན། རིགས་ཀྱི་བུ་འམ་རིགས་ཀྱི་བུ་མོ་དེའི་བསོད་ནམས་ཅི་ཙམ་ཞིག་ཏུ་འཕེལ་བར་འགྱུར།
en: Blessed Lord, how much merit will noble sons or noble daughters accrue when they rejoice in those mindsets of bodhisattva great beings who are novices entering the vehicle in that manner, when they rejoice in those mindsets of bodhisattva great beings who have been practicing for a long time, when they rejoice in those mindsets of irreversible bodhisattva great beings, and when they rejoice in those mindsets of bodhisattva great beings who are destined for only one more rebirth?”

source: དེ་སྐད་ཅེས་གསོལ་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །ཀཽ་ཤི་ཀ་གླིང་ཆེན་པོ་བཞི་པའི་འཇིག་རྟེན་གྱི་ཁམས་ནི་སྐྲའི་རྩེ་མོའི་ཚད་ཀྱིས། ཚད་གཟུང་བར་རུང་ཡང་སྲིད་ཀྱིས། དེ་དག་གི་རྗེས་སུ་ཡི་རང་བ་དང་ལྡན་པའི་སེམས་བསྐྱེད་པའི་བསོད་ནམས་ལ་ནི་ཚད་མེད་དོ།
en: The Blessed One then replied to Śakra, mighty lord of the gods, “Kauśika, you may even be able to measure in units of the tip of a hair this world system of the four continents, but you cannot measure the merits of those who set their mind on enlightenment while they are rejoicing.

source: །ཀཽ་ཤི་ཀ་སྟོང་གི་འཇིག་རྟེན་གྱི་ཁམས་དང་། སྟོང་གཉིས་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་དང་། སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ནི་སྐྲའི་རྩེ་མོའི་ཚད་ཀྱིས། ཚད་གཟུང་བར་རུང་ཡང་སྲིད་ཀྱིས། དེ་དག་གི་རྗེས་སུ་ཡི་རང་བ་དང་ལྡན་པའི་སེམས་བསྐྱེད་པའི་བསོད་ནམས་ལ་ནི་ཚད་མེད་དོ།
en: Kauśika, you may even be able to measure in units of the tip of a hair the world systems of a chiliocosm, the world systems of a dichiliocosm, and the world systems of a great trichiliocosm, but you cannot measure the merits of those who set their mind on enlightenment while they are rejoicing.

source: །ཀཽ་ཤི་ཀ་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་རྒྱ་མཚོ་ཆེན་པོ་རྣམས་ལ་ཆུའི་ཕུང་པོ་ཇི་སྙེད་ཅིག་ཡོད་པ་དེ་དག་ནི། སྐྲའི་རྩེ་མོ་བརྒྱར་གཤེགས་པའི་ཆ་གཅིག་གིས། ཆུའི་ཐིགས་པ་བླང་བའི་ཚད་ཀྱིས་ཚད་དག་གཟུང་བར་རུང་ཡང་སྲིད་ཀྱིས། དེ་དག་གི་རྗེས་སུ་ཡི་རང་བ་དང་ལྡན་པའི་སེམས་བསྐྱེད་པའི་བསོད་ནམས་ལ་ནི་ཚད་མེད་དོ། །དེ་སྐད་ཅེས་བཀའ་སྩལ་པ་དང་།
en: Kauśika, you may even be able to measure in units of one hundredth of the tip of a hair all the mass of water in the oceans of this world system of the great trichiliocosm, taking out the water drop by drop, but you cannot measure the merits of those who set their minds on enlightenment while they are rejoicing.”

source: ལྷའི་དབང་པོ་བརྒྱ་བྱིན་གྱིས། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་གང་སེམས་བསྐྱེད་པ་དེ་དག་ལ་རྗེས་སུ་ཡི་རང་བར་མི་བགྱིད་པའི་སེམས་ཅན་དེ་དག་ནི་བདུད་ཀྱིས་བྱིན་གྱིས་བརླབས་པའོ།
en: Śakra, mighty lord of the gods, then said to the Blessed One, “Blessed Lord, beings who would not rejoice in those who have set their mind on enlightenment are influenced by Māra.

source: །བཅོམ་ལྡན་འདས་གང་སེམས་བསྐྱེད་པ་དེ་དག་ལ་རྗེས་སུ་ཡི་རང་བར་མི་བགྱིད་པའི་སེམས་ཅན་དེ་དག་ནི་བདུད་ཀྱི་ཕྱོགས་སུ་གྱུར་པའོ།
en: Blessed Lord, beings who would not rejoice in those who have set their mind on enlightenment are on the side of Māra.

source: །བཅོམ་ལྡན་འདས་གང་སེམས་བསྐྱེད་པ་དེ་དག་ལ་རྗེས་སུ་ཡི་རང་བར་མི་བགྱིད་པའི་སེམས་ཅན་དེ་དག་ནི་བདུད་ཀྱི་གནས་ནས་ཤི་འཕོས་པའོ།
en: Blessed Lord, beings who would not rejoice in those who have set their mind on enlightenment have been reborn here after dying in the domain of Māra.

source: །དེ་ཅིའི་སླད་དུ་ཞེ་ན། བཅོམ་ལྡན་འདས་གང་གིས་སེམས་བསྐྱེད་པ་འདི་བསྒྲུབས་ཏེ། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་བསྔོ་བའི་སེམས་ཅན་དེ་དག་ནི་བདུད་ཀྱི་གནས་འཇིག་པར་བགྱིད་པ་སྟེ།
en: If one were to ask why, Blessed Lord, it is because beings who have achieved this setting of the mind on enlightenment and dedicated [the merit] toward unsurpassed, complete enlightenment destroy the domain of Māra.

source: གང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་བསྐྱེད་པའི་སེམས་དེ་དག་ནི་རྗེས་སུ་ཡི་རང་བར་བགྱི་བ་སྟེ།
en: One should rejoice in beings who have set their mind on unsurpassed, complete enlightenment.

source: གང་གིས་སངས་རྒྱས་ཡོངས་སུ་མ་བཏང་བ་དང་། ཆོས་ཡོངས་སུ་མ་བཏང་བ་དང་། དགེ་འདུན་ཡོངས་སུ་མ་བཏང་བ་དེ་དག་གིས་སེམས་བསྐྱེད་པ་དེ་དག་ལ་རྗེས་སུ་ཡི་རང་བར་བགྱིའོ།
en: Any who do not forsake the Buddha, who do not forsake the Dharma, and who do not forsake the Saṅgha should rejoice in those who have set their mind on enlightenment.

source: །རྗེས་སུ་ཡི་རང་ནས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་བསྔོ་བར་བགྱི་སྟེ།
en: Then, having rejoiced, {Ki.V: 37} they should dedicate [the merit] to unsurpassed, complete enlightenment.

source: ཇི་ལྟར་གཉིས་ཀྱི་འདུ་ཤེས་སུ་མི་འགྱུར་བ་དང་། གཉིས་སུ་མ་མཆིས་པའི་འདུ་ཤེས་སུ་ཡང་མི་འགྱུར་བ་དེ་ལྟར་ཡོངས་སུ་བསྔོ་བར་བགྱིའོ།
en: This dedication should be made in such a way that there is no notion of duality and no notion of nonduality.” “

source: ཇི་སྐད་སྨྲས་པ་དེ་དེ་བཞིན་ནོ།
en: It is just as you have said.

source: །ཀཽ་ཤི་ཀ་གང་སེམས་བསྐྱེད་པ་འདི་དག་ལ་རྗེས་སུ་ཡི་རང་བར་བྱེད་པ་དེ་དག་ནི་མྱུར་དུ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་མཉེས་པར་བྱེད་པར་འགྱུར་ཏེ། མཉེས་པར་བྱས་ནས་ཀྱང་ཐུགས་བྱུང་བར་མི་འགྱུར་རོ།
en: Kauśika, rejoicing in those who have set their mind on enlightenment, they will swiftly come to please the tathāgatas, arhats, completely awakened buddhas, and having once pleased them they will not displease them.

source: །དེ་ལྟར་དེ་དག་རྗེས་སུ་ཡི་རང་བ་དང་ལྡན་པའི་སེམས་བསྐྱེད་པའི་དགེ་བའི་རྩ་བ་དེ་དག་དང་ལྡན་པ་དག་ནི། གང་དང་གང་དུ་སྐྱེས་པ་དེ་དང་དེ་དག་ཏུ་རིམ་གྲོར་བྱ་བར་འགྱུར་རོ། །བཀུར་སྟིར་བྱ་བར་འགྱུར་རོ། །བསྟི་སྟང་དུ་བྱ་བར་འགྱུར་རོ། །མཆོད་པར་བྱ་བར་འགྱུར་རོ།
en: Those endowed with the roots of virtuous action, setting their mind on enlightenment combined with rejoicing, will be served, respected, honored, and worshiped, wherever they are reborn.

source: །དེས་ནམ་ཡང་གཟུགས་ཡིད་དུ་མི་འོང་བ་མཐོང་བར་མི་འགྱུར་རོ།
en: They will never again perceive unpleasant sights.

source: །ནམ་ཡང་སྒྲ་ཡིད་དུ་མི་འོང་བ་ཐོས་པར་མི་འགྱུར་རོ།
en: They will never hear unpleasant sounds.

source: །ནམ་ཡང་དྲི་ཡིད་དུ་མི་འོང་བ་ཚོར་བར་མི་འགྱུར་རོ། །ནམ་ཡང་རོ་ཡིད་དུ་མི་འོང་བ་མྱོང་བར་མི་འགྱུར་རོ།
en: They will never smell unpleasant odors. They will never savor unpleasant tastes.

source: །ནམ་ཡང་རེག་ཡིད་དུ་མི་འོང་བ་རེག་པར་མི་འགྱུར་རོ།
en: They will never touch unpleasant tangible objects.

source: །ནམ་ཡང་ཆོས་ཡིད་དུ་མི་འོང་བ་ཤེས་པར་མི་འགྱུར་རོ།
en: They will never be conscious of unpleasant mental phenomena.

source: །ནམ་ཡང་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་དང་བྲལ་བར་མི་འགྱུར་ཏེ།
en: They will never be without the buddhas.

source: སངས་རྒྱས་ཀྱི་ཞིང་ནས་སངས་རྒྱས་ཀྱི་ཞིང་དུ་འགྲོ་ཞིང་། སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་ལ་བསྙེན་བཀུར་བྱེད་པ་དང་།
en: They will move from buddhafield to buddhafield, and they will venerate the lord buddhas.

source: དགེ་བའི་རྩ་བ་བསྐྱེད་པར་འགྱུར་རོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: They will develop the roots of virtuous action.

source: ཀཽ་ཤི་ཀ་དེ་ནི་འདི་ལྟར་རིགས་ཀྱི་བུ་དང་། རིགས་ཀྱི་བུ་མོ་དེ་དག་གིས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཐེག་པ་ལ་གསར་དུ་ཞུགས་པ་དང་། སྤྱོད་པ་ལ་ཞུགས་པ་དང་། ཕྱིར་མི་ལྡོག་པ་དང་སྐྱེ་བ་གཅིག་གིས་ཐོགས་པ། ཚད་མེད་གྲངས་མེད་དཔག་ཏུ་མེད་པ་རྣམས་ཀྱིས་དགེ་བའི་རྩ་བ་དེ་དག་ལ་རྗེས་སུ་ཡི་རང་བར་བྱས་པའི་ཕྱིར་ཏེ།
en: If you ask why, Kauśika, it is because those noble sons or noble daughters have rejoiced in the roots of virtuous action acquired by inestimable and immeasurable bodhisattva great beings, including novices entering the vehicle, those who are engaged in practice, those who are irreversible, and those who are destined for only one more rebirth.

source: དགེ་བའི་རྩ་བ་དེ་དག་གིས་རྣམ་པར་འཕེལ་བས། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཉེ་བར་གྱུར་པ་ཡིན་ཏེ། དེ་དག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས་སེམས་ཅན་ཚད་མེད་གྲངས་མེད་དཔག་ཏུ་མེད་པ་ཡོངས་སུ་མྱ་ངན་ལས་ཟློ་བར་འགྱུར་རོ།
en: Enhanced by those roots of virtuous action, they will approach unsurpassed, complete enlightenment, and after attaining consummate buddhahood in unsurpassed, complete enlightenment, they will bring inestimable, countless, measureless beings to final nirvāṇa. “

source: །ཀོའུ་ཤི་ཀ་རྣམ་གྲངས་དེས་ཀྱང་རིགས་ཀྱི་བུ་འམ། རིགས་ཀྱི་བུ་མོ་དེས་ཅི་ནས་ཀྱང་སེམས་མེད་པ་དང་། སེམས་མ་ཡིན་པ་གཞན་ཡང་མེད་པར་ཐེག་པ་ལ་གསར་དུ་ཞུགས་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་དགེ་བའི་རྩ་བ་ལ་རྗེས་སུ་ཡི་རང་བར་བྱས་ཤིང་། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་བསྔོ་བར་བྱའོ།
en: For that reason, Kauśika, noble sons or noble daughters should by all means rejoice in the roots of virtuous action, possessed by bodhisattva great beings who are novices entering the vehicle, and they should then dedicate this [merit] toward unsurpassed, complete enlightenment, doing so free of a mindset and free of anything else other than a mindset.

source: །སེམས་མེད་པ་དང་། སེམས་མ་ཡིན་པ་གཞན་ཡང་མེད་པར་སྤྱད་པ་སྤྱོད་པ་དང་། ཕྱིར་མི་ལྡོག་པ་དང་། སྐྱེ་བ་གཅིག་གིས་ཐོགས་པ་རྣམས་ཀྱི་དགེ་བའི་རྩ་བ་དེ་དག་ལ་ཡང་རྗེས་སུ་ཡི་རང་བར་བྱས་ཤིང་། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་བསྔོ་བར་བྱའོ།
en: They should rejoice in those roots of virtuous action [possessed by bodhisattva great beings] who are engaged in practice, who are irreversible, and who are destined for only one more rebirth, and then they should dedicate that [merit] toward unsurpassed, complete enlightenment, doing so free of a mind and free of anything else other than a mind.

source: །དེ་ནས་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་གྱིས།
en: ”{Ki.

source: བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན་སྒྱུ་མ་ལྟ་བུའི་སེམས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་བ་ལགས། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: V: 44} Then the venerable Subhūti asked the Blessed One, “Blessed Lord, how does the illusion-like mind attain consummate buddhahood in unsurpassed, complete enlightenment?” “

source: རབ་འབྱོར་དེ་ཇི་སྙམ་དུ་སེམས། སྒྱུ་མ་ལྟ་བུའི་སེམས་དེ་ཁྱོད་ཀྱིས་ཡང་དག་པར་རྗེས་སུ་མཐོང་ངམ།
en: Subhūti, do you think that you can observe the illusion-like mind?”

source: གསོལ་པ་བཅོམ་ལྡན་འདས་དེ་ནི་མ་ལགས་ཏེ།
en: asked the Blessed One in return. “No, Blessed Lord!

source: བཅོམ་ལྡན་འདས་བདག་གིས་སྒྱུ་མ་ཡང་ཡང་དག་པར་རྗེས་སུ་མ་མཐོང་སྒྱུ་མ་ལྟ་བུའི་སེམས་དེ་ཡང་ཡང་དག་པར་རྗེས་སུ་མ་མཐོང་ངོ་།
en: Blessed Lord, I do not observe illusion, nor indeed do I observe illusion-like mind.” {Ki.

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་དེ་ཇི་སྙམ་དུ་སེམས། དེ་ལྟར་སྒྱུ་མ་ཡང་མ་མཐོང་སྒྱུ་མ་ལྟ་བུའི་སེམས་ཀྱང་མ་མཐོང་ན། སེམས་གང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བའི་སེམས་དེ་ཁྱོད་ཀྱིས་ཡང་དག་པར་རྗེས་སུ་མཐོང་ངམ།
en: V: 45} “Subhūti,” continued the Blessed One, “if you cannot even perceive illusion or illusion-like mind, do you think that you can observe that mind that would attain consummate buddhahood in unsurpassed, complete enlightenment?” “

source: གསོལ་པ་བཅོམ་ལྡན་འདས་དེ་ནི་མ་ལགས་སོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: No, Blessed Lord!” “

source: རབ་འབྱོར་དེ་ཇི་སྙམ་དུ་སེམས། སྒྱུ་མ་དང་། སྒྱུ་མ་ལྟ་བུའི་སེམས་ལས་གུད་ན་ཆོས་གང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བའི་ཆོས་དེ་ཁྱོད་ཀྱིས་ཡང་དག་པར་རྗེས་སུ་མཐོང་ངམ། གསོལ་པ་བཅོམ་ལྡན་འདས་དེ་ནི་མ་ལགས་ཏེ།
en: Subhūti,” continued the Blessed One, “do you think that you can observe anything other than illusion or illusion-like mind that would attain consummate buddhahood in unsurpassed, complete enlightenment?” “

source: བཅོམ་ལྡན་འདས་སྒྱུ་མ་དང་། སྒྱུ་མ་ལྟ་བུའི་སེམས་ལས་གུད་ན་ཆོས་གང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བ་དེ་བདག་གིས་ཡང་དག་པར་རྗེས་སུ་མ་མཐོང་ངོ་།
en: No, Blessed Lord, I do not observe anything other than illusion or illusion-like mind that would attain consummate buddhahood in unsurpassed, complete enlightenment. “

source: །བཅོམ་ལྡན་འདས་དེ་ལྟར་བདག་གིས་ཆོས་གཞན་ཡང་དག་པར་རྗེས་སུ་མ་མཐོང་ན། མཆིས་པ་འམ། མ་མཆིས་པའི་ཆོས་གང་ཞིག་བདག་གིས་བསྟན་པར་བགྱི། ཆོས་གང་ཤིན་ཏུ་དབེན་པ་དེ་ནི་མཆིས་པ་འམ་མ་མཆིས་པར་མི་འགྱུར་རོ།
en: Blessed Lord, since I do not observe anything extraneous, I should disclose [the nature of] phenomena in terms of being existent or nonexistent: Anything that is absolutely void is neither existent nor nonexistent.

source: །ཆོས་གང་ཤིན་ཏུ་དབེན་པ་དེ་ནི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་མི་རྒྱ་སྟེ།
en: Anything that is absolutely void will not attain consummate buddhahood in unsurpassed, complete enlightenment.

source: མ་མཆིས་པའི་ཆོས་ཀྱང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་མི་རྒྱའོ།
en: Indeed, anything that is nonexistent will not attain consummate buddhahood in unsurpassed, complete enlightenment.

source: །དེ་ཅིའི་སླད་དུ་ཞེ་ན། བཅོམ་ལྡན་འདས་དེ་ནི་འདི་ལྟར་གང་ཉོན་མོངས་པར་འགྱུར་བ་འམ། རྣམ་པར་བྱང་བར་འགྱུར་བའི་ཆོས་ཐམས་ཅད་ནི་མ་མཆིས་ཤིང་ཡོངས་སུ་མ་མཆིས་པའོ།
en: If one were to ask why, Blessed Lord, it is because this applies to all phenomena, defiled or purified, which are nonexistent and utterly nonexistent. “

source: །དེ་ཅིའི་སླད་དུ་ཞེ་ན། བཅོམ་ལྡན་འདས་དེ་ནི་འདི་ལྟར་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ནི་ཤིན་ཏུ་དབེན་པའོ།
en: If one were to ask why, Blessed Lord, it is because the perfection of wisdom is absolutely void.

source: །བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ནི་ཤིན་ཏུ་དབེན་པའོ།
en: The perfection of meditative concentration is absolutely void.

source: །བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ནི་ཤིན་ཏུ་དབེན་པའོ།
en: The perfection of perseverance is absolutely void.

source: །བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ནི་ཤིན་ཏུ་དབེན་པའོ།
en: The perfection of tolerance is absolutely void.

source: །ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ནི་ཤིན་ཏུ་དབེན་པའོ།
en: The perfection of ethical discipline is absolutely void.

source: །སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ནི་ཤིན་ཏུ་དབེན་པའོ།
en: The perfection of generosity is absolutely void.

source: །ནང་སྟོང་པ་ཉིད་ནི་ཤིན་ཏུ་དབེན་པའོ།
en: The emptiness of internal phenomena is absolutely void. [

source: །དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་ནི་ཤིན་ཏུ་དབེན་པའོ།
en: The other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities, are absolutely void.

source: །དྲན་པ་ཉེ་བར་བཞག་པ་རྣམས་ནི་ཤིན་ཏུ་དབེན་པའོ།
en: The applications of mindfulness are absolutely void.

source: །ཡང་དག་པར་སྤོང་བ་རྣམས་དང་རྫུ་འཕྲུལ་གྱི་རྐང་པ་རྣམས་དང་། དབང་པོ་རྣམས་དང་སྟོབས་རྣམས་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་རྣམས་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་ནི་ཤིན་ཏུ་དབེན་པའོ།
en: The correct exertions, the supports for miraculous ability, the faculties, the powers, the branches of enlightenment, and the noble eightfold path are absolutely void.

source: །འཕགས་པའི་བདེན་པ་རྣམས་དང་། བསམ་གཏན་རྣམས་དང་། ཚད་མེད་པ་རྣམས་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་ནི་ཤིན་ཏུ་དབེན་པའོ།
en: The truths of the noble ones, the meditative concentrations, the immeasurable attitudes, and the formless absorptions are absolutely void.

source: །རྣམ་པར་ཐར་པ་རྣམས་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་དང་སྟོང་པ་ཉིད་དང་མཚན་མ་མེད་པ་དང་སྨོན་པ་མེད་པ་ནི་ཤིན་ཏུ་དབེན་པའོ།
en: The aspects of liberation, the serial steps of meditative absorption, emptiness, signlessness, and wishlessness are absolutely void.

source: །མངོན་པར་ཤེས་པ་རྣམས་དང་། ཏིང་ངེ་འཛིན་རྣམས་དང་། གཟུངས་ཀྱི་སྒོ་རྣམས་ནི་ཤིན་ཏུ་དབེན་པའོ།
en: The extrasensory powers, the meditative stabilities, and the dhāraṇī gateways are absolutely void.

source: །དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པ་རིག་པ་བཞི་དང་། བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ནི་ཤིན་ཏུ་དབེན་པའོ།
en: The ten powers of the tathāgatas, the four fearlessnesses, the four kinds of exact knowledge, great loving kindness, great compassion, and the eighteen distinct qualities of the buddhas are absolutely void. [

source: །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་ནི་ཤིན་དུ་དབེན་པའོ།
en: The goals], up to and including all-aspect omniscience, are absolutely void.

source: །ཆོས་གང་ཤིན་ཏུ་དབེན་པ་དེ་ནི་བསྒོམ་པར་བགྱི་བ་ཡང་མ་ལགས། རྣམ་པར་བསྒོམ་པར་བགྱི་བ་ཡང་མ་ལགས་ཏེ།
en: There is nothing at all that is absolutely void that is to be cultivated, and nothing that is to be uncultivated.

source: དེ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཤིན་ཏུ་དབེན་པའི་སླད་དུ་ཆོས་གང་ཡང་བསྒྲུབ་པ་མ་མཆིས་སོ།
en: Since the perfection of wisdom is absolutely void, there is nothing at all that is to be attained.

source: །ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ནི་ཤིན་ཏུ་དབེན་པ་ལགས་ན། ཇི་ལྟར་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་བརྟེན་ཅིང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར།
en: Since the perfection of wisdom is absolutely void, how will bodhisattva great beings attain consummate buddhahood in unsurpassed, complete enlightenment, dependent on the perfection of wisdom?

source: བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཀྱང་ཤིན་ཏུ་དབེན་པ་ལགས་ན། ཇི་ལྟར་དབེན་པས་དབེན་པ་འཚང་རྒྱ་བར་འགྱུར།
en: Since unsurpassed, complete enlightenment, too, is absolutely void, how can voidness attain buddhahood through voidness?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་ལེགས་སོ།
en: Excellent, Subhūti, excellent!” replied the Blessed One. {

source: །རབ་འབྱོར་དེ་དེ་བཞིན་ནོ།
en: V: 46} “Subhūti, it is so!

source: རབ་འབྱོར་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ནི་ཤིན་ཏུ་དབེན་པའོ།
en: Subhūti, the perfection of wisdom is absolutely void.

source: །བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ནི་ཤིན་ཏུ་དབེན་པའོ།
en: The perfection of meditative concentration, the perfection of perseverance, the perfection of tolerance, the perfection of ethical discipline, and the perfection of generosity are absolutely void.
